xrun(64): 22.03-s001: (c) Copyright 1995-2022 Cadence Design Systems, Inc.
TOOL:	xrun(64)	22.03-s001: Started on Jul 24, 2023 at 11:21:07 -03
xrun
	register.v
	register_test.v
	-access +rw
	-gui
	-input waves.tcl
Recompiling... reason: unable to stat '/./home/aosantos/test_sanity_cademics/register.v'.
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		register_test
	Building instance overlay tables: .................... Done
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		             Instances  Unique
		Modules:             2       2
		Registers:           5       5
		Scalar wires:        2       -
		Vectored wires:      2       -
		Always blocks:       1       1
		Initial blocks:      2       2
		Pseudo assignments:  3       3
	Writing initial simulation snapshot: worklib.register_test:v
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/cadence/cadence/installsXCELIUM2203/tools/xcelium/files/xmsimrc
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm register_test.clk register_test.data_in register_test.data_out register_test.rst -waveform
Created probe 1
xcelium> reset
Loaded snapshot worklib.register_test:v
xcelium> run
At time 20 rst=0 data_in=01010101 data_out=01010101
At time 30 rst=0 data_in=10101010 data_out=10101010
At time 40 rst=0 data_in=11111111 data_out=11111111
At time 50 rst=1 data_in=11111111 data_out=00000000
TEST PASSED
xmsim: *W,RNQUIE: Simulation is complete.
xcelium> write -csv .
xmsim: *E,TCLERR: /usr/bin/write: invalid option -- 'c'

Usage:
 write [options] <user> [<ttyname>]

Options:
 -V, --version    output version information and exit
 -h, --help       display this help and exit
.
    while executing
"exec /usr/bin/write -csv ."
    invoked from within
"write -csv ."
xcelium> write --csv
xmsim: *E,TCLERR: /usr/bin/write: unrecognized option '--csv'

Usage:
 write [options] <user> [<ttyname>]

Options:
 -V, --version    output version information and exit
 -h, --help       display this help and exit
.
    while executing
"exec /usr/bin/write --csv"
    invoked from within
"write --csv"
xcelium> write
xmsim: *E,TCLERR: 
Usage:
 write [options] <user> [<ttyname>]

Options:
 -V, --version    output version information and exit
 -h, --help       display this help and exit
.
    while executing
"exec /usr/bin/write"
    invoked from within
"write"
xcelium> write -csv /home/aosantos/
xmsim: *E,TCLERR: /usr/bin/write: invalid option -- 'c'

Usage:
 write [options] <user> [<ttyname>]

Options:
 -V, --version    output version information and exit
 -h, --help       display this help and exit
.
    while executing
"exec /usr/bin/write -csv /home/aosantos/"
    invoked from within
"write -csv /home/aosantos/"
xcelium> help write
xmsim: *E,UNKCMD: unrecognized command (write).
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	22.03-s001: Exiting on Jul 24, 2023 at 11:31:24 -03  (total: 00:10:17)
